[Settings]
;執行時預設隱藏輸入介面
StartHidden = 0

;無任何輸入時是否顯示狀態提示
ShowStates = 1

;開啟/關閉輸入介面熱鍵
ToggleKey = ^Space

;中/英輸入切換熱鍵，可設定兩個熱鍵
;EnSwitch2 不使用可以註解
EnSwitch  = LShift
;EnSwitch2 = RShift
;EnSwitch  = CapsLock

;按下 中/英切換熱鍵 到放開，間隔在多少毫秒內才判定動作，CapsLock除外。
EnSwitchTimout = 75

;設定為1，Shift + ,.[]' 為送下排符號
;設定為0，Shift + ,.[]' 為送上排符號
ShiftAltered = 1

; 數字鍵盤在全形模式下送字方式
; 0為半形，1為全形
NumpadFullWidth = 1

;選字間的間隔
SelGap = 10
;一次顯示幾個選字
SelNum = 5
;選字編號字體大小比例
SelNumScale = 0.6
;系統輸入法自動修正為英數模式
;有0、1、2共三個設定值，0不修正。若是 1 無法自動修正可以用 2 試試看。
SysImePatch = 0

;自訂字詞優先選項，設定值為1時，拆碼重相同的情況下，可以將自訂字詞列為優先順序。
UserPrior = 0

;-----------------------------------------------------------------
;外觀設定                                                         
;顏色設定有16進制6位數與8位數，8位數的最左邊兩位數是透明度設定值。
;-----------------------------------------------------------------
;字體設定 - BMP
FontName    = 新細明體
;字體設定 - Unicode 第2平面(SIP)
FontNameExt = 新細明體-ExtB
;粗體字
FontBold = 1
;文字尺寸
FontSize = 50
;文字輪廓寬度，數值 -1 為使用文字尺寸的 1/10 為輪廓寬度
OutlineWidth = -1
;文字外圍留白空間
MarginX = 5
MarginY = 0
OffsetX = 0
OffsetY = 5
;背景顏色與圓角設定
BackRound  = 5
BackGround = c0664128
;字根文字顏色
KeyColor   = 006633
;字根文字輪廓顏色
KeyOutline = ffffffff
;選字編號顏色
NumColor   = 660000
;選字編號輪廓顏色
NumOutline = ffffffff
;選字顏色
SelColor   = 000066
;選字輪廓顏色
SelOutline = fff0f0f0

;--------------
;表格檔對應設定
;--------------
[Table]
;通用表格檔，不管切換到哪一個表格檔，都可以使用本表格字根碼
;目前表格內容以符號類為主。
common = _common
;注音查詢用表格檔
phonetic = _phonetic,注
;使用者自訂字詞
user = _user

;表格檔設定的格式:
;<功能碼> = <表格檔名稱>, <提示文字>, <字型名稱>, <字型名稱-擴展字集用>
;後面兩個字型名稱為可選設定，有需要時再額外設定，不需要可省略
;
;預設表格的功能碼固定是 default，用「,,t」切換。
;
default = Liu,嘸

;下面是自訂加入的表格，等號前面是功能碼，輸入該功能碼可切換到該表格。
;簡體中文 - 打繁出簡
,,c = LiuT2S,簡
;日文
,,j = LiuJAP,日
;韓文
; ,,k = Kor,韓

;--------------
;全域熱鍵
;--------------
[Global_Hotkeys]
;` = +{tab}
